andrej102/progect_line_V3/line_V3.ioc
#MicroXplorer Configuration settings - do not modify
PF7.GPIOParameters=GPIO_Label
Dma.TIM2_CH2.1.FIFOMode=DMA_FIFOMODE_DISABLE
PH0-OSC_IN.Locked=true
Dma.TIM2_CH2.1.Priority=DMA_PRIORITY_LOW
PB13.GPIOParameters=GPIO_Label
PH0-OSC_IN.Signal=RCC_OSC_IN
Dma.TIM2_CH2.1.SignalID=NONE
FREERTOS.configUSE_DAEMON_TASK_STARTUP_HOOK=1
NVIC.DMA1_Stream2_IRQn=true\:11\:0\:true\:false\:true\:true\:false\:true
PB14.GPIO_Label=LED_RED
RCC.PLLFRACN=3072
PD3.GPIOParameters=GPIO_Label
PA13(JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
PD8.Locked=true
RCC.RTCFreq_Value=32000
PB6.GPIO_Label=COLUMN2
PD0.Locked=true
PD4.Locked=true
RCC.CpuClockFreq_Value=550000000
PD2.GPIOParameters=GPIO_Label
PC5.Mode=RMII
PB13.Signal=ETH_TXD1
PG13.Signal=ETH_TXD0
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
PF6.GPIO_Label=MUX7
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.AHB4Freq_Value=275000000
USART3.VirtualMode-Asynchronous=VM_ASYNC
Dma.TIM2_UP.0.MemDataAlignment=DMA_MDATAALIGN_WORD
RCC.LPTIM1Freq_Value=137500000
SH.GPXTI7.ConfNb=1
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
Dma.TIM2_UP.0.Mode=DMA_CIRCULAR
FREERTOS.configENABLE_FPU=1
Dma.TIM2_CH2.1.PeriphDataAlignment=DMA_PDATAALIGN_WORD
PF7.Signal=GPIO_Input
Dma.TIM2_CH2.1.Direction=DMA_MEMORY_TO_PERIPH
RCC.I2C4Freq_Value=137500000
TIM2.IPParameters=Channel-PWM Generation2 No Output,Prescaler,Period
PD4.Signal=GPIO_Output
PB6.Signal=GPIO_Input
PA13(JTMS/SWDIO).Locked=true
RCC.DIVQ3Freq_Value=129000000
PD0.Signal=GPIO_Output
PD8.Signal=USART3_TX
VP_TIM2_VS_ClockSourceINT.Signal=TIM2_VS_ClockSourceINT
PE1.Signal=GPIO_Output
PB3(JTDO/TRACESWO).GPIO_Label=SWO
PF10.GPIO_Label=S2
PB13.Locked=true
ProjectManager.ProjectBuild=false
PG13.Locked=true
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Dma.TIM2_UP.0.Priority=DMA_PRIORITY_LOW
PB2.Signal=GPIO_Input
PF1.GPIO_Label=MUX2
RCC.DIVM2=1
PD1.GPIOParameters=GPIO_Label
RCC.DIVM1=4
PD1.GPIO_Label=DATA1
SH.GPXTI7.0=GPIO_EXTI7
PB12.GPIO_Label=ROW4
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.9.0
MxDb.Version=DB.6.0.20
PB0.GPIOParameters=GPIO_Label
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=275000000
PC4.GPIO_Label=RMII_RXD0
FREERTOS.HEAP_NUMBER=5
PB3(JTDO/TRACESWO).Signal=DEBUG_JTDO-SWO
PB1.GPIO_Label=LIGHT_CONTROL
RCC.USART16Freq_Value=137500000
PF10.Locked=true
PH1-OSC_OUT.Locked=true
PA8.Signal=RCC_MCO_1
PF2.Locked=true
PE1.Locked=true
PB6.Locked=true
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
PF3.Signal=GPIO_Input
RCC.DIVR2Freq_Value=608000000
Dma.TIM2_UP.0.SignalID=NONE
Dma.TIM2_CH2.1.PeriphInc=DMA_PINC_DISABLE
Dma.TIM2_CH2.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
ProjectManager.HalAssertFull=false
RCC.DIVP2Freq_Value=608000000
VP_TIM2_VS_no_output2.Signal=TIM2_VS_no_output2
RCC.MCO2PinFreq_Value=550000000
Mcu.Package=LQFP144
PB9.Signal=GPIO_Output
TIM2.Prescaler=275
PB1.Signal=GPIO_Output
PF8.GPIOParameters=GPIO_Label
NVIC.TimeBase=TIM1_UP_IRQn
PG13.GPIOParameters=GPIO_Label
PD5.GPIOParameters=GPIO_Label
NVIC.TimeBaseIP=TIM1
USART3.IPParameters=VirtualMode-Asynchronous
PA10.Signal=USB_OTG_HS_ID
Dma.TIM2_CH2.1.MemInc=DMA_MINC_ENABLE
RCC.DFSDMFreq_Value=137500000
PF7.Locked=true
PB14.GPIOParameters=GPIO_Label
Dma.TIM2_CH2.1.Mode=DMA_CIRCULAR
Dma.TIM2_CH2.1.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
RCC.TraceFreq_Value=275000000
RCC.APB4Freq_Value=137500000
RCC.CECFreq_Value=32000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
RCC.LPUART1Freq_Value=137500000
PA13(JTMS/SWDIO).GPIO_Label=SWDIO
PB10.GPIOParameters=GPIO_Label
PB13.Mode=RMII
PD5.Locked=true
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
PF4.GPIOParameters=GPIO_Label
PC4.Mode=RMII
RCC.VCO3OutputFreq_Value=258000000
PB7.GPIO_PuPd=GPIO_PULLDOWN
Dma.TIM2_CH2.1.MemDataAlignment=DMA_MDATAALIGN_WORD
ProjectManager.ProjectFileName=line_V3.ioc
RCC.DIVQ1=6
FREERTOS.Tasks01=defaultTask,24,128,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL
PD9.GPIO_Label=STLK_VCP_TX
Mcu.PinsNb=62
PC13.Locked=true
PC13.Signal=GPIO_Input
PA9.GPIO_Label=USB_FS_VBUS
RCC.SWPMI1Freq_Value=137500000
PB6.GPIO_PuPd=GPIO_PULLDOWN
FREERTOS.configCHECK_FOR_STACK_OVERFLOW=2
PD3.Signal=GPIO_Output
PB8.GPIO_PuPd=GPIO_PULLDOWN
PB11.GPIO_Label=ROW3
PD1.Signal=GPIO_Output
PA11.GPIO_Label=USB_FS_DM
RCC.DIVP1=1
Dma.TIM2_CH2.1.EventEnable=DISABLE
PB14.Locked=true
PC14-OSC32_IN.Signal=RCC_OSC32_IN
RCC.QSPIFreq_Value=275000000
PG13.GPIO_Label=RMII_TXD0
Mcu.Pin60=VP_TIM2_VS_no_output2
Mcu.Pin61=VP_TIM3_VS_ClockSourceINT
PF8.GPIO_Label=S0
ETH.IPParameters=MediaInterface
PD10.Signal=GPIO_Output
RCC.D1CPREFreq_Value=550000000
Dma.TIM2_UP.0.EventEnable=DISABLE
PB8.GPIO_Label=COLUMN4
RCC.USART234578Freq_Value=137500000
RCC.Tim1OutputFreq_Value=275000000
PC15-OSC32_OUT.Locked=true
Mcu.Pin59=VP_TIM2_VS_ClockSourceINT
Mcu.Pin57=VP_FREERTOS_VS_CMSIS_V2
RCC.SPI123Freq_Value=91666666.66666667
Mcu.Pin58=VP_SYS_VS_tim1
Mcu.Pin51=PB5
Mcu.Pin52=PB6
Mcu.Pin50=PB3(JTDO/TRACESWO)
Mcu.Pin55=PB9
Mcu.Pin56=PE1
Mcu.Pin53=PB7
Mcu.Pin54=PB8
PA9.Signal=USB_OTG_HS_VBUS
Dma.TIM2_UP.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
RCC.DIVN2=19
RCC.DIVN1=34
PB11.GPIOParameters=GPIO_Label
PB5.Locked=true
PB9.Locked=true
PD8.Mode=Asynchronous
Mcu.Pin48=PG11
Mcu.Pin49=PG13
Mcu.Pin46=PD4
Mcu.Pin47=PD5
PB10.Signal=GPIO_Output
PF3.GPIOParameters=GPIO_Label
PB14.Signal=GPIO_Output
Dma.TIM2_UP.0.SyncEnable=DISABLE
RCC.USBCLockSelection=RCC_USBCLKSOURCE_HSI48
Mcu.Pin40=PA13(JTMS/SWDIO)
Mcu.Pin41=PA14(JTCK/SWCLK)
Mcu.Pin44=PD2
Mcu.Pin45=PD3
Mcu.Pin42=PD0
Mcu.Pin43=PD1
PE1.GPIO_Label=LED_YELLOW
Dma.TIM2_CH2.1.SyncSignalID=NONE
ProjectManager.LastFirmware=true
NVIC.TIM3_IRQn=true\:10\:0\:true\:false\:true\:true\:true\:true
PF2.GPIOParameters=GPIO_Label
PB3(JTDO/TRACESWO).GPIOParameters=GPIO_Label
RCC.AHB12Freq_Value=275000000
PA1.Mode=RMII
Mcu.Pin37=PA10
Mcu.Pin38=PA11
Mcu.Pin35=PA8
Mcu.Pin36=PA9
VP_SYS_VS_tim1.Signal=SYS_VS_tim1
PG7.GPIO_Label=USB_FS_OVCR
Mcu.Pin39=PA12
RCC.RNGFreq_Value=48000000
PF4.GPIO_Label=MUX5
Mcu.Pin30=PB14
PA1.GPIO_Label=RMII_REF_CLK
PF11.Locked=true
Mcu.Pin33=PD10
TIM3.IPParameters=Prescaler,Period
Mcu.Pin34=PG7
Mcu.Pin31=PD8
Mcu.Pin32=PD9
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
TIM2.Period=3
PA14(JTCK/SWCLK).Mode=Trace_Asynchronous_SW
VP_TIM2_VS_no_output2.Mode=PWM Generation2 No Output
ProjectManager.FreePins=false
RCC.LPTIM2Freq_Value=137500000
PF9.GPIOParameters=GPIO_Label
Mcu.Pin26=PB10
Mcu.Pin27=PB11
Mcu.Pin24=PB2
ProjectManager.UnderRoot=true
Mcu.Pin25=PF11
Mcu.Pin28=PB12
Mcu.Pin29=PB13
Mcu.Pin22=PB0
PB5.Signal=GPIO_Input
ETH.MediaInterface=HAL_ETH_RMII_MODE
Mcu.Pin23=PB1
Mcu.Pin20=PC4
Dma.TIM2_UP.0.PeriphInc=DMA_PINC_DISABLE
Mcu.Pin21=PC5
PD10.Locked=true
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
PB5.GPIO_PuPd=GPIO_PULLDOWN
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
ProjectManager.CompilerOptimize=6
PG11.Mode=RMII
PA11.Signal=USB_OTG_HS_DM
ProjectManager.HeapSize=0x200
Mcu.Pin15=PH1-OSC_OUT
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PC1
Mcu.Pin13=PF10
PF8.Locked=true
Mcu.Pin14=PH0-OSC_IN
Mcu.Pin19=PA7
PF10.GPIOParameters=GPIO_Label
RCC.LPTIM345Freq_Value=137500000
ProjectManager.ComputerToolchain=false
PF9.Signal=GPIO_Output
Mcu.Pin17=PA1
Mcu.Pin18=PA2
RCC.LTDCFreq_Value=129000000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PF8
PF0.GPIO_Label=MUX1
Mcu.Pin12=PF9
PD0.GPIOParameters=GPIO_Label
Mcu.Pin10=PF7
PF3.Locked=true
PA8.Mode=Clock-out-1
PA14(JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PF4.Signal=GPIO_Input
PD2.Signal=GPIO_Output
RCC.HCLK3ClockFreq_Value=275000000
Dma.TIM2_CH2.1.RequestNumber=1
PD1.Locked=true
PB0.Signal=GPIO_Output
Dma.TIM2_UP.0.SyncSignalID=NONE
Dma.TIM2_UP.0.SyncRequestNumber=1
PA7.GPIOParameters=GPIO_Label
PC1.Signal=ETH_MDC
PB12.GPIOParameters=GPIO_Label
PG7.GPIOParameters=GPIO_Label
PD2.GPIO_Label=DATA2
PC1.Mode=RMII
Dma.TIM2_UP.0.RequestNumber=1
Mcu.Family=STM32H7
RCC.DIVQ2Freq_Value=608000000
ProjectManager.MainLocation=Core/Src
Dma.TIM2_UP.0.PeriphDataAlignment=DMA_PDATAALIGN_WORD
Dma.TIM2_UP.0.Direction=DMA_PERIPH_TO_MEMORY
RCC.SAI1Freq_Value=91666666.66666667
RCC.CortexFreq_Value=550000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H723ZGTx
PD9.GPIOParameters=GPIO_Label
Dma.TIM2_CH2.1.SyncRequestNumber=1
RCC.HPRE=RCC_HCLK_DIV2
PC5.Locked=true
PF0.GPIOParameters=GPIO_Label
PA12.GPIOParameters=GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_ETH_Init-ETH-false-HAL-true,5-MX_USART3_UART_Init-USART3-false-HAL-true,6-MX_USB_OTG_HS_USB_Init-USB_OTG_HS-false-HAL-true,7-MX_TIM2_Init-TIM2-false-HAL-true,8-MX_TIM3_Init-TIM3-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PA9.GPIOParameters=GPIO_Label
PA11.GPIOParameters=GPIO_Label
PD0.GPIO_Label=DATA0
PA11.Mode=OTG/Dual-Role-Device-FS
PH0-OSC_IN.GPIOParameters=GPIO_Label
PA14(JTCK/SWCLK).Locked=true
PB0.GPIO_Label=LED_GREEN
NVIC.TIM1_UP_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:true
PD2.Locked=true
RCC.VCO2OutputFreq_Value=1216000000
PC13.GPIO_Label=B1 (Blue_User_Button)
PC1.Locked=true
PB13.GPIO_Label=RMII_TXD1
PB11.Signal=GPIO_Output
PD9.Mode=Asynchronous
PG11.Signal=ETH_TX_EN
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_PuPd,GPIO_Label
VP_FREERTOS_VS_CMSIS_V2.Mode=CMSIS_V2
Dma.TIM2_UP.0.MemInc=DMA_MINC_ENABLE
RCC.VCOInput3Freq_Value=2000000
PA13(JTMS/SWDIO).Mode=Trace_Asynchronous_SW
Mcu.IP4=FREERTOS
Mcu.IP5=NVIC
Mcu.IP2=DMA
Mcu.IP3=ETH
Mcu.IP0=CORTEX_M7
Mcu.IP1=DEBUG
PA12.Signal=USB_OTG_HS_DP
Mcu.UserConstants=
PF9.Locked=true
PC1.GPIOParameters=GPIO_Label
PF1.GPIOParameters=GPIO_Label
RCC.DIVP3Freq_Value=129000000
RCC.SDMMCFreq_Value=91666666.66666667
PF5.Locked=true
Mcu.ThirdPartyNb=0
PA14(JTCK/SWCLK).GPIOParameters=GPIO_Label
RCC.HCLKFreq_Value=275000000
Mcu.IPNb=12
ProjectManager.PreviousToolchain=
PF1.Locked=true
TIM3.Period=100
RCC.SPDIFRXFreq_Value=91666666.66666667
PF11.GPIO_Label=S3
PD8.GPIOParameters=GPIO_Label
FREERTOS.configUSE_MALLOC_FAILED_HOOK=1
Mcu.Pin6=PF3
Mcu.Pin7=PF4
Mcu.Pin8=PF5
Mcu.Pin9=PF6
PA13(JTMS/SWDIO).GPIOParameters=GPIO_Label
FREERTOS.IPParameters=Tasks01,configENABLE_FPU,configTOTAL_HEAP_SIZE,HEAP_NUMBER,configUSE_IDLE_HOOK,configUSE_TICK_HOOK,configUSE_MALLOC_FAILED_HOOK,configCHECK_FOR_STACK_OVERFLOW,configUSE_DAEMON_TASK_STARTUP_HOOK
PH0-OSC_IN.GPIO_Label=MCO
Mcu.Pin0=PC13
Mcu.Pin1=PC14-OSC32_IN
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC15-OSC32_OUT
Mcu.Pin3=PF0
Mcu.Pin4=PF1
PD10.GPIOParameters=GPIO_Label
Mcu.Pin5=PF2
RCC.DIVR3Freq_Value=129000000
RCC.HSE_VALUE=8000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
TIM2.Channel-PWM\ Generation2\ No\ Output=TIM_CHANNEL_2
Mcu.IP10=USART3
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:true
Mcu.IP11=USB_OTG_HS
RCC.DIVP1Freq_Value=550000000
PC14-OSC32_IN.Mode=LSE-External-Oscillator
PF7.GPIO_Label=MUX8
PA14(JTCK/SWCLK).GPIO_Label=SWCLK
VP_SYS_VS_tim1.Mode=TIM1
TIM3.Prescaler=275
PF11.Signal=GPIO_Output
File.Version=6
PA10.GPIO_Label=USB_FS_ID
PB7.Signal=GPIO_Input
Dma.TIM2_CH2.1.Polarity=HAL_DMAMUX_REQ_GEN_RISING
PB8.Locked=true
PG13.Mode=RMII
PF11.GPIOParameters=GPIO_Label
Dma.RequestsNb=2
PB6.GPIOParameters=GPIO_PuPd,GPIO_Label
PB0.Locked=true
FREERTOS.configTOTAL_HEAP_SIZE=131072
ProjectManager.ProjectName=line_V3
RCC.APB3Freq_Value=137500000
PB7.GPIO_Label=COLUMN3
PA7.Locked=true
RCC.D1PPRE=RCC_APB3_DIV2
PG11.Locked=true
PD5.GPIO_Label=RW
PB3(JTDO/TRACESWO).Mode=Trace_Asynchronous_SW
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=RMII_MDIO
PF5.GPIO_Label=MUX6
PF8.Signal=GPIO_Output
RCC.DIVR1Freq_Value=275000000
PF5.Signal=GPIO_Input
PF4.Locked=true
PB5.GPIO_Label=COLUMN1
Dma.Request1=TIM2_CH2
FREERTOS.configUSE_TICK_HOOK=1
PC4.Locked=true
PG11.GPIO_Label=RMII_TX_EN
PF0.Signal=GPIO_Input
PC5.Signal=ETH_RXD1
PD3.GPIO_Label=DATA3
Dma.Request0=TIM2_UP
PF3.GPIO_Label=MUX4
VP_TIM3_VS_ClockSourceINT.Mode=Internal
PC14-OSC32_IN.Locked=true
RCC.Tim2OutputFreq_Value=275000000
RCC.DFSDMACLkFreq_Value=91666666.66666667
PA2.Locked=true
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
PG7.Locked=true
PB8.GPIOParameters=GPIO_PuPd,GPIO_Label
PA7.Mode=RMII
PG7.Signal=GPXTI7
PB9.GPIO_Label=ROW1
PA10.Mode=OTG/Dual-Role-Device-FS
ProjectManager.NoMain=false
Dma.TIM2_CH2.1.SyncEnable=DISABLE
NVIC.SavedSvcallIrqHandlerGenerated=true
RCC.SAI4BFreq_Value=91666666.66666667
PC4.Signal=ETH_RXD0
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
ProjectManager.DefaultFWLocation=true
PD9.Signal=USART3_RX
PD5.Signal=GPIO_Output
NVIC.DMA1_Stream1_IRQn=true\:11\:0\:true\:false\:true\:true\:false\:true
PB12.Locked=true
ProjectManager.DeletePrevious=true
PB10.Locked=true
Dma.TIM2_UP.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
boardIOC=true
PA12.GPIO_Label=USB_FS_DP
RCC.FamilyName=M
PB9.GPIOParameters=GPIO_Label
PD8.GPIO_Label=STLK_VCP_RX
RCC.SPI6Freq_Value=137500000
FREERTOS.configUSE_IDLE_HOOK=1
PA9.Mode=Activate_VBUS_FS
RCC.SPI45Freq_Value=137500000
Dma.TIM2_UP.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,FIFOMode,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
PF6.Signal=GPIO_Input
ProjectManager.TargetToolchain=STM32CubeIDE
PB10.GPIO_Label=ROW2
RCC.VCO1OutputFreq_Value=550000000
PF6.Locked=true
PB7.GPIOParameters=GPIO_PuPd,GPIO_Label
PC5.GPIOParameters=GPIO_Label
PB2.GPIOParameters=GPIO_Label
RCC.AXIClockFreq_Value=275000000
PF2.Signal=GPIO_Input
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
PF5.GPIOParameters=GPIO_Label
PF9.GPIO_Label=S1
PD10.GPIO_Label=USB_FS_PWR_EN
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PD3.Locked=true
PA1.Signal=ETH_REF_CLK
RCC.CKPERFreq_Value=64000000
PB1.Locked=true
board=NUCLEO-H723ZG
RCC.VCOInput1Freq_Value=16000000
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=137500000
MxCube.Version=6.2.0
VP_TIM2_VS_ClockSourceINT.Mode=Internal
PC13.GPIOParameters=GPIO_Label
PD4.GPIO_Label=RS
Dma.TIM2_UP.0.FIFOMode=DMA_FIFOMODE_DISABLE
RCC.FDCANFreq_Value=91666666.66666667
PF10.Signal=GPIO_Output
RCC.ADCFreq_Value=608000000
PC1.GPIO_Label=RMII_MDC
PA10.GPIOParameters=GPIO_Label
PD4.GPIOParameters=GPIO_Label
PB3(JTDO/TRACESWO).Locked=true
PH1-OSC_OUT.Signal=RCC_OSC_OUT
PF0.Locked=true
PF1.Signal=GPIO_Input
Dma.TIM2_CH2.1.Instance=DMA1_Stream2
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVM2,DIVN1,DIVN2,DIVP1,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLLFRACN,QSPIFreq_Value,RNGFreq_Value,RTCFreq_Value,SAI1Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBCLockSelection,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32H723ZGTx
NVIC.SavedPendsvIrqHandlerGenerated=true
PA2.Signal=ETH_MDIO
PB2.Locked=true
Mcu.IP8=TIM2
VP_FREERTOS_VS_CMSIS_V2.Signal=FREERTOS_VS_CMSIS_V2
Mcu.IP9=TIM3
Mcu.IP6=RCC
Mcu.IP7=SYS
ProjectManager.CoupleFile=false
RCC.SYSCLKFreq_VALUE=550000000
RCC.I2C123Freq_Value=137500000
PA7.GPIO_Label=RMII_CRS_DV
PA1.Locked=true
PA12.Mode=OTG/Dual-Role-Device-FS
KeepUserPlacement=false
PC5.GPIO_Label=RMII_RXD1
PB2.GPIO_Label=SWITCH_BOX
PF6.GPIOParameters=GPIO_Label
RCC.SAI4AFreq_Value=91666666.66666667
PB7.Locked=true
RCC.DIVQ1Freq_Value=91666666.66666667
PA2.Mode=RMII
PB8.Signal=GPIO_Input
RCC.D3PPRE=RCC_APB4_DIV2
RCC.VCOInput2Freq_Value=64000000
PD9.Locked=true
RCC.APB1Freq_Value=137500000
PB11.Locked=true
ProjectManager.DeviceId=STM32H723ZGTx
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
PG11.GPIOParameters=GPIO_Label
PE1.GPIOParameters=GPIO_Label
PB1.GPIOParameters=GPIO_Label
Dma.TIM2_UP.0.Instance=DMA1_Stream1
PA7.Signal=ETH_CRS_DV
PF2.GPIO_Label=MUX3
isbadioc=false
